cask "rstudio"               # IDE for R                            ## rm
cask "quarto"                # Quarto for data science              ## rm
cask "pdf-expert"            # PDF viewer                           ## rm
cask "microsoft-teams"       # Collaboration and communication      ## rm
cask "bbedit"                # Basic Text Editor                    ## rm
brew "kiwix"                    # Wikipedia client
brew "octave"               ## docker

cask "zen-browser"

# Cask Applications --------------------------
cask "brave-browser"         # Privacy-focused browser
cask "utm"                   # Virtual Machine
cask "carbon-copy-cloner@6"  # Backup software
cask "skim"                  # Lightweight PDF Viewer
cask "raycast"               # Productivity tool
cask "iterm2"                # Terminal emulator
cask "calibre"               # Library for Books
cask "zotero"                # Library for Academic Documents
cask "backblaze"             # Cloud backup service
cask "vlc"                   # Media Viewer
cask "freetube"              # YouTube Client
cask "transmission"          # Torrent client
cask "visual-studio-code"    # IDE
brew "biber"
# Development Tools --------------------------
brew "git"                   # Version Control
brew "git-lfs"               # VCS for Large Files
brew "gh"                    # GitHub CLI
brew "lazygit"               # Git Interface
cask "docker"                # Container management
brew "gcc"                   # GNU Compiler Collection


# Languages --------------------------
brew "bash"                  # Bash shell (macOS version is outdated)
brew "node"
cask "r"                     # R Statistical Language               ## docker

brew "texlive"               # LaTeX distribution                   ## docker
brew "pandoc"                # Document conversion (including LaTeX)## docker
brew "uv"                    # Python environment management        ## docker
cask "quarto"                # Data science rendering               ## docker


# CLI Programs --------------------------
brew "lf"                    # File browser
brew "yazi"                  # File renaming tool
brew "massren"               # Mass file renaming
brew "fd"                    # Fast file search (alternative to find)
brew "bat"                   # Better cat (view files with syntax highlighting)
brew "chafa"                 # Image preview in the terminal
brew "libsixel"              # Image preview for Zellij
brew "mediainfo"             # Media metadata tool
brew "file"                  # File type detection
brew "neovim"                # Modern Vim
brew "tmux"                  # Terminal Multiplexer
brew "w3m"                   # Text-based web browser
brew "mdcat"                 # Markdown to terminal viewer
brew "mpv"                   # Media player
brew "ripgrep"               # Fast search tool (similar to grep)
brew "fzf"                   # Fuzzy finder for files and text
brew "htop"                  # Process viewer

# Utilities --------------------------
brew "mas"                   # Mac App Store CLI
brew "stow"                  # Dotfiles management
brew "wget"                  # Download files from the web (like curl)
cask "hiddenbar"             # Hide icons in the menu bar
cask "grandperspective"      # Disk space viewer
cask "mission-control-plus"  # Window management tool
cask "xquartz"               # X Window System support
cask "wine-stable"           # Run Windows applications on macOS
cask "aldente"               # Battery manager

# Fonts --------------------------
cask "font-jetbrains-mono-nerd-font"  # Nerd font for developers
