# Cask Applications --------------------------
cask "iterm2"
cask "utm"
cask "obsidian"
cask "arc"
cask "carbon-copy-cloner@6"   # Backup software
cask "calibre"                # Library for Books
cask "zotero"                 # Library for Academic Documents
cask "backblaze"              # Cloud backup service
cask "vlc"                    # Media Viewer
cask "freetube"               # YouTube Client
cask "skim"                   # Lightweight PDF Viewer
cask "transmission"           # Torrent client

# Development Tools --------------------------
brew "git-lfs"               # VCS for Large Files
brew "gh"                    # GitHub CLI
brew "lazygit"               # Git Interface
brew "docker"                # Container management
# IDES
cask "visual-studio-code"     # IDE
brew "neovim"                # Modern Vim
# TeX and Markdown
brew "texlive"               # LaTeX distribution
brew "texlab"                # LSP
brew "biber"
brew "latexindent"
brew "pandoc"                # Document conversion (including LaTeX)
cask "quarto"
brew "llvm"
brew "node"
# CLI Programs --------------------------
brew "chafa"                 # Image preview in the terminal
brew "mediainfo"             # Media metadata tool
brew "file"                  # File type detection
brew "imagemagick"
brew "mpv"                   # Media player
brew "fzf"                   # Fuzzy finder for files and text

# Utilities --------------------------
cask "libreoffice"
brew "stow"                  # Dotfiles management
cask "hiddenbar"             # Hide icons in the menu bar
cask "grandperspective"      # Disk space viewer
cask "mission-control-plus"  # Window management tool
cask "xquartz"               # X Window System support
cask "wine-stable"           # Run Windows applications on macOS
cask "aldente"
brew "mas"
#mas "", 6739505345
brew "stow"
# Fonts --------------------------
cask "font-jetbrains-mono-nerd-font"  # Nerd font for developers

