brew "lynx"                 # CLI Browser
cask "utm"                  # Virtual Machine
cask "silhouette-studio"
cask "iterm2"               # Terminal Emulator
cask "arc"

# General
cask "firefox"              # Web Browser
cask "calibre"              # Library for Books
cask "zotero"               # Library for Academic Documents
cask "plex"                 # Media Server
cask "pdf-expert"           # PDF Editor
cask "whatsapp"             # Messaging
cask "backblaze"            # Backups
cask "vlc"                  # Media Viewer
cask "skim"                 # Lightweight PDF Viewer
tap "zegervdv/zathura"      # Tap for Zathura
brew "zathura"              # Zathura PDF Viewer
brew "zathura-pdf-poppler"  #
cask "netnewswire"          # RSS Reader
cask "freetube"             # YouTube Client
cask "transmission"         #
cask "noxappplayer"         # Emulator


# Editors
brew "neovim"               # Vim
brew "luarocks"
brew "utf8proc"
brew "shellcheck"           # Shell LSP
brew "shfmt"                # Shell Formating
# brew "bash-debug-adapter"   # Shell debugging
cask "neovide"              # Vim Gui
cask "bbedit"               # Basic Text Editor
cask "visual-studio-code"   # IDE
cask "zed"                  # Modern gui IDE
cask "obsidian"             # Note Taking
cask "rstudio"              # IDE For R and Python
brew "glow"                 # Markdown previewer

# Dev Tools
brew "git"                  # Version Control
brew "gh"                   # GitHub
brew "lazygit"              # Git Interface
cask "docker"               # Container

# Languages
brew "bash"                 # version in macOS is outdated
brew "perl"
brew "ruby"
brew "julia"                # Julia Scientific Computing Language
cask "r"                    # R Statistical Language
cask "quarto"               # Quarto
brew "openjdk"              # Java Compiler
brew "gcc"                  # GNU Compiler Connection
brew "llvm"                 # Low Level Virtual Machine
brew "sbcl"                 #
brew "texlive"              # latex
brew "pandoc"               # converting to and from latex
brew "tcl-tk"               # Tkinter
brew "python-tk"            # TkInter

# File Browser
brew "lf"
brew "massren"              # rename files
brew "fd"                   # find directories
brew "jq"                   # JSON Processing
brew "bat"                  # Cleaner output than cat
brew "chafa"                # Image Preview
brew "libsixel"             # Image Preview for Zellij
brew "mediainfo"            # Media Metadata
brew "file"                 # File Type Detection
brew "poppler"              # PDF Previewer in Terminal

# Utilities
brew "mas"                  # Mac App Store
brew "wget"                 # similar to curl
brew "ripgrep"              # regex tool
brew "fzf"                  # Fuzzy find files
brew "tmux"                 # Terminal Multiplexing
brew "zellij"               # Better Terminal Multiplexing
brew "mprocs"               # Better Terminal Multiplexing
brew "ffmpeg"               # audio and video editing
brew "htop"                 # see processes running
brew "duti"                 # set default applications macOS
brew "doxygen"              # create documentation from comments
brew "help2man"             # create man page from -h or --help flag
cask "amethyst"
brew "cmake"                # Expanded make utilities
brew "ninja"
cask "hiddenbar"            # Hidden icons in menu bar
cask "grandperspective"     # Disk Viewer
cask "mission-control-plus" # Advanced Window Management
cask "xquartz"              # X-Window Support
cask "wine-stable"          # Run NT Applications
cask "aldente"              # Batter Manager

# Fonts
cask "font-jetbrains-mono-nerd-font"

