davidanson.vscode-markdownlint
kortina.vscode-markdown-notes
yzhang.markdown-all-in-one
redhat.vscode-yaml
tamasfe.even-better-toml
foxundermoon.shell-format
rpinski.shebang-snippets
timonwong.shellcheck
zechenturm.vhdl-doxygen-comments
ms-vscode.hexeditor
streetsidesoftware.code-spell-checker
stkb.rewrap
usernamehw.errorlens
yoshi389111.visible-whitespace
cschlosser.doxdocgen
esbenp.prettier-vscode
mechatroner.rainbow-csv
vscode-icons-team.vscode-icons
vscodevim.vim
zainchen.json
repositony.vscodemcnp
