# Cask Applications --------------------------
cask "arc"
cask "carbon-copy-cloner@6"  # Backup software
cask "skim"                  # Lightweight PDF Viewer
cask "pdf-expert"            # PDF viewer                           ## rm
cask "raycast"               # Productivity tool
cask "iterm2"                # Terminal emulator
cask "ghostty"               # Terminal emulator
cask "calibre"               # Library for Books
cask "zotero"                # Library for Academic Documents
cask "backblaze"             # Cloud backup service
cask "vlc"                   # Media Viewer
cask "freetube"              # YouTube Client
cask "transmission"          # Torrent client
cask "visual-studio-code"    # IDE

brew "nushell"

cask "nikitabobko/tap/aerospace"

# Development Tools --------------------------
brew "git"                   # Version Control
brew "git-lfs"               # VCS for Large Files
brew "gh"                    # GitHub CLI
brew "lazygit"               # Git Interface
cask "docker"                # Container management

# Languages --------------------------
brew "node"
brew "gcc"                   # GNU Compiler Collection
brew "texlive"               # LaTeX distribution
brew "biber"
brew "latexindent"
brew "pandoc"                # Document conversion (including LaTeX)
cask "quarto"
brew "uv"
brew "mdcat"                 # Markdown to terminal viewer

# CLI Programs --------------------------
brew "lf"                    # File browser
brew "zoxide"                # CD with fuzzy finder
brew "yazi"                  # File renaming tool
brew "massren"               # Mass file renaming
brew "fd"                    # Fast file search (alternative to find)
brew "bat"                   # Better cat (view files with syntax highlighting)
brew "eza"                   # Alternative to ls
brew "chafa"                 # Image preview in the terminal
brew "libsixel"              # Image preview for Zellij
brew "mediainfo"             # Media metadata tool
brew "file"                  # File type detection
brew "neovim"                # Modern Vim
brew "imagemagick"
brew "luajit"
brew "tmux"                  # Terminal Multiplexer
brew "w3m"                   # Text-based web browser
brew "mpv"                   # Media player
brew "ripgrep"               # Fast search tool (similar to grep)
brew "fzf"                   # Fuzzy finder for files and text
brew "htop"                  # Process viewer

# Utilities --------------------------
brew "mas"                   # Mac App Store CLI
brew "stow"                  # Dotfiles management
brew "wget"                  # Download files from the web (like curl)
cask "hiddenbar"             # Hide icons in the menu bar
cask "grandperspective"      # Disk space viewer
cask "mission-control-plus"  # Window management tool
cask "xquartz"               # X Window System support
cask "wine-stable"           # Run Windows applications on macOS
cask "aldente"               # Battery manager

# Fonts --------------------------
cask "font-jetbrains-mono-nerd-font"  # Nerd font for developers

